app/Controllers/Admin/DashboardController.php

SELECT *
FROM `projects`
WHERE `is_active` = 1
AND `end_date` >= '2026-06-05'
ORDER BY `start_date` ASC
---
    public function index()
    {
        $ticketModel  = new TicketModel();
        $projectModel = new ProjectModel();
        $centerModel  = new CenterModel();

        // FIX (M3): Piggyback auto-close on dashboard load so resolved tickets
        // get closed after 2 hours even without a dedicated cron job.
        // Pass debounce=true so this runs at most once per 15 min — prevents
        // a ticket from auto-closing immediately after the admin resolves it.
        $ticketModel->autoCloseResolved(true);

        $today = date('Y-m-d');
        $activeProjects = $projectModel
            ->where('is_active', 1)
            ->where('end_date >=', $today)
            ->orderBy('start_date', 'ASC')
            ->findAll();

SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'open'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'in_progress'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'resolved'
SELECT COUNT(*) AS `numrows` FROM `centers`
---

        $data = [
            'title'            => 'Admin Dashboard',
            'total_tickets'    => $ticketModel->countAll(),
            'open_tickets'     => $ticketModel->where('status', 'open')->countAllResults(),
            'in_progress'      => $ticketModel->where('status', 'in_progress')->countAllResults(),
            'resolved_tickets' => $ticketModel->where('status', 'resolved')->countAllResults(),
            'active_projects'  => count($activeProjects),
            'total_centers'    => $centerModel->countAll(),