app/Controllers/AuthController.php

    public function loginProcess()
    {
        // Rate limiting — max 10 attempts per IP per minute
        $throttler = \Config\Services::throttler();
        if ($throttler->check('login_' . md5($this->request->getIPAddress()), 10, MINUTE) === false) {
            $this->writeLoginLog(null, 'rate_limited', $this->request->getIPAddress());
            return redirect()->back()->withInput()
                ->with('error', 'Too many login attempts. Please wait 1 minute and try again.');
        }

        $identifier = strtoupper(trim($this->request->getPost('username') ?? ''));
        $password   = trim($this->request->getPost('password') ?? '');

        if (! $identifier || ! $password) {
            return redirect()->back()->withInput()->with('error', 'Please enter username and password.');
        }

        // Cap input lengths before any DB work — prevents DoS via huge string comparisons
        if (strlen($identifier) > 100 || strlen($password) > 100) {
            $this->writeLoginLog(null, 'failed', $this->request->getIPAddress());
            return redirect()->back()->withInput()->with('error', 'Invalid credentials. Please check your Center Code and OTP.');
        }

        // ── 1. Try Admin login ───────────────────────────────────────
        // FIX (M1): Single case-insensitive query with bound parameter — no second
        // LOWER(username) query which bypassed CI4 query builder escaping.
        $userModel = new UserModel();
        $adminUser = $userModel->allowCallbacks(false)
            ->where('username', strtolower($identifier))
            ->where('is_active', 1)
            ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `is_active` = 1
 LIMIT 1

    private function writeLoginLog(
        ?int    $userId,
        string  $result,
        string  $ip,
        string  $loginType = 'unknown',
        ?int    $centerId  = null,
        ?int    $projectId = null
    ): void {
        try {
            $db = \Config\Database::connect();
            $db->table('login_logs')->insert([
                'user_id'    => $userId,
                'center_id'  => $centerId,
                'project_id' => $projectId,
                'login_type' => $loginType,
                'result'     => $result,          // 'success', 'failed', 'rate_limited'
                'ip_address' => $ip,
                'user_agent' => substr($this->request->getUserAgent()->getAgentString(), 0, 255),
                'logged_at'  => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO `login_logs` (`user_id`, `center_id`, `project_id`, `login_type`, `result`, `ip_address`, `user_agent`, `logged_at`) VALUES (1, NULL, NULL, 'admin', 'success', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/148.0.0.0 Safari/537.36', '2026-06-05 12:26:18')